export const  dualist =[
    {
        id: 1,
        title: "ঘুম থেকে উঠার পর দুআ ",
        arabic: "اَلْحَمْدُ لِلّٰهِ الَّذِیْۤ اَحْیَانَا بَعْدَ مَاۤ اَمَاتَنَا وَ اِلَیْهِ النُّشُوْرُ",
        bangla:"‘আলহামদুলিল্লা হিল্লাজি আহইয়ানা বা’দা মা আমাতানা ওয়া ইলাইহিন নুশুর’",
        meaning:"অর্থ : সমস্ত প্রশংসা আল্লাহর জন্য, যিনি আমাদের মৃত করার পর পুনরায় জীবিত করেছেন। আর তার দিকেই সবার পুনরুত্থান। ",
        reference: "(বুখারি, হাদিস : ৬৩২৪) (মুসলিম, হাদিস : ২৭১১)",
      },
        {
            id: 2,
            title: "ঘুমের আগে দুআ ",
            arabic:"اَللَّهُمَّ بِاسْمِكَ أَمُوتُ وَأَحْيَ",
            bangla:"আল্লাহুম্মা বিসমিকা আমুতু ওয়া আহইযা",
            meaning:"অর্থ : হে আল্লাহ, আপনার নামেই আমি মৃত্যুবরণ করি এবং আপনার নামেই জীবিত হই।",
            reference: "(বুখারি, হাদিস : ৬৩২৪) (মুসলিম, হাদিস : ৪৮৮৬)",
        },



]