export const duaByPhophet = [
  {
    id: 1,
    reference: "(সুরা আরাফ: ২৩)",
    title: "আদম (আ.)-এর দোয়া",
    arabic:
      "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
    bangla:
      "‘রব্বানা-জালামনা আনফুছানা-ওয়া ইল্লাম তাগফিরলানা-ওয়া তারহামনা-লানাকূনান্না মিনাল খা-সিরীন।’",
    meaning:
      "অর্থ: ‘হে আমাদের রব! আমরা নিজেদের প্রতি অন্যায় করেছি, যদি আপনি আমাদের ক্ষমা না করেন এবং দয়া না করেন, তাহলে তো আমরা ক্ষতিগ্রস্তদের অন্তর্ভুক্ত হব।’",
  },
  {
    id: 2,
    reference: "(সুরা আম্বিয়া: ৮৭)",
    title: " ইউনুস (আ.)-এর দোয়া",
    arabic:
      " لَّا اِلٰهَ اِلَّاۤ اَنۡتَ سُبۡحٰنَکَ اِنِّیۡ کُنۡتُ مِنَ الظّٰلِمِیۡنَ",
    bangla: " ‘লা ইলাহা ইল্লা আনতা সুবহানাকা ইন্নী কুনতু মিনাজ জোয়ালিমীন।",
    meaning:
      " অর্থ: ‘আপনি (আল্লাহ) ছাড়া কোনো উপাস্য নেই, আপনি পবিত্র ও মহান, আমি তো সীমালঙ্ঘনকারী।’",
  },
  {
    id: 3,
    reference: "(সুরা কাসাস: ১৬)",
    title: "মুসা (আ.)-এর দোয়া",
    arabic: "رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي",
    bangla: " ‘রাব্বি ইন্নী জালামতু নাফসী ফাগফিরলী।’",
    meaning:
      "অর্থ: ‘হে আমার রব! আমি নিজের প্রতি অবিচার করেছি। আমাকে ক্ষমা করে দিন।’ ",
  },
  {
    id: 4,
    reference: "(সুরা নামল: ১৯)",
    title: "সোলায়মান (আ.)-এর দোয়া",
    arabic:
      " رَبِّ اَوۡزِعۡنِیۡۤ اَنۡ اَشۡکُرَ نِعۡمَتَکَ الَّتِیۡۤ اَنۡعَمۡتَ عَلَیَّ وَ عَلٰی وَالِدَیَّ وَ اَنۡ اَعۡمَلَ صَالِحًا تَرۡضٰىهُ وَ اَدۡخِلۡنِیۡ بِرَحۡمَتِکَ فِیۡ عِبَادِکَ الصّٰلِحِیۡنَ",
    bangla:
      " ‘রাব্বি আওঝি-নী আন আশকুরা নি’মাতাকাল্লাতী আনআমতা আলায়্যা ওয়াআলা ওয়া-লিদায়্যা ওয়াআন আ’মালা স’লিহান তারদ্বা-হু ওয়াআদখিলনী বিরাহমাতিকা ফী ইবা-দিকাস সালিহীন।’",
    meaning:
      "অর্থ: ‘হে আমার রব! আপনি আমাকে সামর্থ্য দিন, যাতে আমি আপনার প্রতি কৃতজ্ঞতা প্রকাশ করতে পারি—আমার প্রতি ও আমার মা-বাবার প্রতি আপনি যে অনুগ্রহ করেছেন তার জন্য। আর আমি যেন সৎকাজ করতে পারি, যা আপনি পছন্দ করেন। আপনার অনুগ্রহে আমাকে আপনার সত্কর্মপরায়ণ বান্দাদের অন্তর্ভুক্ত করুন।’ ",
  },

  {
    id: 5,
    reference: "(সুরা আম্বিয়া: ৮৯)",
    title: "জাকারিয়া (আ.)-এর দোয়া",
    arabic: "رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ",
    bangla: "রাব্বি লা-তাযারনী ফারদাওঁ ওয়া আনতা খাইরুল ওয়ারিছীন।",
    meaning:
      "হে আমার রব! আমাকে একা রেখো না, তুমি তো শ্রেষ্ঠ মালিকানার অধিকারী।",
  },
  {
    id: 6,
    reference: "(সুরা আম্বিয়া: ৮৩)",
    title: "আইয়ুব (আ.)-এর দোয়া",
    arabic: "رَبَّهُ أَنِّي مَسَّنِيَ الضُّرُّ وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ",
    bangla: "রাব্বাহূ আন্নী মাস্ নানিয়াদ্ব্ দ্বরুরু অআন্তা আরহামুর-রাহিমীন।",
    meaning: "আমি দুঃখ-কষ্টে পড়েছি আর তুমি তো সর্বশ্রেষ্ঠ দয়ালু।",
  },
  {
    id: 7,
    reference: "(সুরা মুমিনুন: ২৬)",
    title: "নুহ (আ.)-এর দোয়া",
    arabic: "رَبِّ انۡصُرۡنِیۡ بِمَا کَذَّبُوۡنِ",
    bangla: "রাব্বি আনসিরনী বিমা- কাযযাবূন",
    meaning:
      "হে আমার রব! আমাকে সাহায্য করুন ওই বিষয়ে, যে বিষয়ে তারা আমাকে মিথ্যা প্রতিপন্ন করছে।",
  },

  {
    id: 8,
    reference: "(সুরা আরাফ: ৮৯)",
    title: "শোয়াইব (আ.)-এর দোয়া",
    arabic:
      "رَبَّنَا افۡتَحۡ بَیۡنَنَا وَ بَیۡنَ قَوۡمِنَا بِالۡحَقِّ وَ اَنۡتَ خَیۡرُ الۡفٰتِحِیۡنَ",
    bangla:
      "রাব্বানাফতাহ বাইনানা ওয়াবাইনা ক্বাওমিনা বিলহাক্কি ওয়াআনতা খাইরুল ফা-তিহীন।",
    meaning:
      "হে আমার রব! আমাদের ও আমাদের সম্প্রদায়ের মধ্যে ন্যায্যভাবে মীমাংসা করে দিন এবং আপনিই শ্রেষ্ঠ মীমাংসাকারী।",
  },
  {
    id: 9,
    reference: "(সুরা ইবরাহিম: ৩৫)",
    title: "ইবরাহিম (আ.)-এর দোয়া",
    arabic:
      "رَبِّ اجْعَلْ هَذَا الْبَلَدَ آَمِنًا وَاجْنُبْنِي وَبَنِيَّ أَنْ نَعْبُدَ الْأَصْنَامَ",
    bangla:
      "রাব্বিজআল হাজাল বালাদা আ-মিনাওঁ ওয়াজনুবনি ওয়াবানিয়্যা আন না’বুদাল আসনাম।",
    meaning:
      "হে আমার প্রতিপালক! এই শহরকে নিরাপদে রাখো এবং আমাকে ও আমার সন্তানদেরকে মুর্তিপূজা থেকে দূরে রাখো।",
  },

  {
    id: 10,
    reference: "(সুরা বাকারা: ২৫০)",
    title: "দাউদ (আ.)-এর দোয়া",
    arabic:
      "رَبَّنَاۤ اَفۡرِغۡ عَلَیۡنَا صَبۡرًا وَّ ثَبِّتۡ اَقۡدَامَنَا وَ انۡصُرۡنَا عَلَی الۡقَوۡمِ الۡکٰفِرِیۡنَ",
    bangla:
      "রাব্বানাফরিগ আলাইনা সবরাওঁ ওয়াসাব্বিত আক্বদা-মানা ওয়ানসুরনা আলাল ক্বাওমিল কাফিরীন।",
    meaning:
      "হে আমাদের রব! আমাদের ধৈর্য দান করুন। আমাদের পা অবিচল রাখুন এবং অবিশ্বাসী সম্প্রদায়ের বিরুদ্ধে আমাদের সাহায্য করুন।",
  },
  {
    id: 11,
    reference: "(সুরা শুআরা: ১৬৯)",
    title: "লুত (আ.)-এর দোয়া",
    arabic: "رَبِّ نَجِّنِي وَأَهْلِي مِمَّا يَعْمَلُونَ",
    bangla: "রাব্বি নাজজিনী ওয়া আহলী মিম্মা-ইয়া‘মালূন।",
    meaning:
      "হে আমার রব! আমাকে এবং আমার পরিবার-পরিজনকে তারা যা করে তা থেকে রক্ষা করুন।",
  },

  {
    id: 12,
    reference: "(সুরা ইউসুফ: ৮৬)",
    title: "ইয়াকুব (আ.)-এর দোয়া",
    arabic: "اِنَّمَاۤ اَشۡکُوۡا بَثِّیۡ وَ حُزۡنِیۡۤ اِلَی اللّٰهِ",
    bangla: "ইন্নামা- আশকূ বাসসী ওয়াখুজনী ইলাল্লাহ",
    meaning: "আমি আমার অসহনীয় বেদনা, আমার দুঃখ শুধু আল্লাহর কাছে নিবেদন করছি।",
  },
  {
    id: 14,
    reference: "(সুরা সাফফাত: ৩৭)",
    title: "ইবরাহিম (আ.)-এর দোয়া",
    arabic: "رَبِّ هَبۡ لِیۡ مِنَ الصّٰلِحِیۡنَ",
    bangla: "রাব্বি হাবলী মিনাস সালিহীন",
    meaning: "হে আমার রব! আমাকে এক সত্কর্মপরায়ণ সন্তান দান করুন।",
  },
  {
    id: 15,
    reference: "(সুরা আনকাবুত: ৩০)",
    title: "লুত (আ.)-এর দোয়া",
    arabic: "رَبِّ انۡصُرۡنِیۡ عَلَی الۡقَوۡمِ الۡمُفۡسِدِیۡنَ",
    bangla: "রাব্বিনসুরনী আলাল ক্বাওমিল মুফসিদীন",
    meaning:
      "হে আমার রব! আমাকে বিপর্যয় সৃষ্টিকারী সম্প্রদায়ের বিরুদ্ধে সাহায্য করুন।",
  },
  {
    id: 13,
    reference: "(সুরা হুদ: ৪৭)",
    title: "নুহ (আ.)-এর দোয়া",
    arabic:
      "رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ ۖ وَإِلَّا تَغْفِرْ لِي وَتَرْحَمْنِي أَكُن مِّنَ الْخَاسِرِينَ",
    bangla:
      "রাব্বি ইন্নীআঊযুবিকা আন আছআলাকা মা-লাইছা লী বিহী ‘ইলমুওঁ ওয়া ইল্লাতাগফিরলী ওয়া তারহামনী আকুম মিনাল খা-ছিরীন।",
    meaning:
      "হে আমার রব! যে বিষয়ে আমার জ্ঞান নেই, সে বিষয়ে যাতে আপনাকে অনুরোধ না করি—এ জন্য আমি আপনার আশ্রয় চাই। আপনি যদি আমাকে ক্ষমা করেন এবং আমাকে দয়া না করেন, তাহলে আমি ক্ষতিগ্রস্তদের অন্তর্ভুক্ত হব।",
  },
  {
    id: 14,
    reference: "(সুরা ইউসুফ: ১০১)",
    title: "ইউসুফ (আ.)-এর দোয়া",
    arabic:
      "رَبِّ قَدْ ءَاتَيْتَنِى مِنَ ٱلْمُلْكِ وَعَلَّمْتَنِى مِن تَأْوِيلِ ٱلْأَحَادِيثِ ۚ فَاطِرَ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ أَنتَ وَلِىِّۦ فِى ٱلدُّنْيَا وَٱلْـَٔاخِرَةِ ۖ تَوَفَّنِى مُسْلِمًۭا وَأَلْحِقْنِى بِٱلصَّـٰلِحِينَ",
    bangla:
      "‘রাব্বি কাদ আতাইতানি মিনাল মুলকি ওয়া আল্লামতানি মিন তাওয়ীলিল আহাদীস; ফাতি রাস সামাওয়াতি ওয়াল আরদি আন্তা ওয়ালিয়্যে ফিদ দুনিয়া ওয়াল আখিরাতি তাওয়াফ্ফানি মুসলিম ওয়া আলহিকনি বিসালিহীন।’ ",
    meaning:
      " অর্থ: ‘হে আমার রব! আপনি আমাকে রাজ্য দান করেছেন এবং স্বপ্নের ব্যাখ্যা শিক্ষা দিয়েছেন। হে আকাশমণ্ডলী ও পৃথিবীর স্রষ্টা! আপনিই ইহলোক ও পরলোকে আমার অভিভাবক। আপনি আমাকে সত্কর্মপরায়ণদের অন্তর্ভুক্ত করুন।’",
  },
  {
    id: 15,
    reference: "(সুরা মায়িদা: ১১৪)",
    title: "ঈসা (আ.)-এর দোয়া",
    arabic:
      "اللّٰهُمَّ رَبَّنَاۤ اَنۡزِلۡ عَلَیۡنَا مَآئِدَۃً مِّنَ السَّمَآءِ تَکُوۡنُ لَنَا عِیۡدًا لِّاَوَّلِنَا وَ اٰخِرِنَا وَ اٰیَۃً مِّنۡکَ ۚ وَ ارۡزُقۡنَا وَ اَنۡتَ خَیۡرُ الرّٰزِقِیۡنَ",
    bangla:
      "‘আল্লাহুম্মা রাব্বানাআনঝিল ‘আলাইনা-মাইদাতাম মিনাছছামাই তাকূনুলানা-‘ঈদাল লিআওওয়ালিনা-ওয়া আ-খিরিনা-ওয়া আ-ইয়াতাম মিনকা ওয়ারঝুকনা-ওয়া আনতা খাইরুর রা-ঝিকীন।",
    meaning:
      "অর্থ: ‘হে আল্লাহ! আমাদের রব! আমাদের জন্য আসমান থেকে খাদ্যপূর্ণ খাঞ্চা প্রেরণ করুন। এটা আমাদের ও আমাদের পূর্ববর্তী ও পরবর্তী সবার জন্য হবে আনন্দোৎসবস্বরূপ এবং আপনার কাছ থেকে নিদর্শন। আর আমাদের জীবিকা দান করুন; আপনিই তো শ্রেষ্ঠ জীবিকাদাতা।’",
  },
  {
    id: 16,
    reference: "(সুরা মায়িদা: ১১৮)",
    title: "ঈসা (আ.)-এর দোয়া",
    arabic:
      " إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبَادُكَ وَإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيم",
    bangla:
      "‘ইন তুয়াজ্জিবহুম ফাইন্নাহুম ইবাদুকা ওয়া ইন তাগফির লাহুম ফায়িন্নাকা আনতাল আজীঝুল হাকীম’ ",
    meaning:
      "অর্থ: ‘যদি আপনি তাদেরকে শাস্তি দেন, তবে তারা আপনার দাস এবং যদি আপনি তাদেরকে ক্ষমা করেন, তবে আপনিই পরাক্রান্ত, মহাবিজ্ঞ।’ ",
  },
  {
    id: 17,
    reference: "(সুরা বাকারা: ২০১)",
    title: "মুহাম্মদ (স.)-এর দোয়া",
    arabic: "رَبَّنَاۤ اٰتِنَا فِی الدُّنۡیَا حَسَنَۃً وَّ فِی الۡاٰخِرَۃِ حَسَنَۃً وَّ قِنَا عَذَابَ النَّارِ",
    bangla: "‘রাব্বানা আ-তিনা ফিদ্দুনিয়া হাসানাতাওঁ ওয়াক্বিনা আজা-বান না-র।’",
    meaning:
      "অর্থ: ‘হে আমাদের রব! আমাদের পৃথিবীতে কল্যাণ দান করুন এবং পরকালেও কল্যাণ দান করুন। আর আমাদের রক্ষা করুন জাহান্নামের শাস্তি থেকে।’",
  },
  {
    id: 18,
    reference: "(সুরা বনি ইসরাঈল: ৮০)",
    title: "মুহাম্মদ (স.)-এর দোয়া",
    arabic:
      "رَّبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَل لِّي مِن لَّدُنكَ سُلْطَانًا نَّصِيرًا",
    bangla:
      "‘রাব্বি আদখিলনী মুদ খালা সিদকিওঁ ওয়া আখরিজনী মুখরাজা সিদকিওঁ ওয়াজ আলনী মিল্লাদুনকা ছুলতা-নান নাসীরা।’",
    meaning:
      "অর্থ: হে পালনকর্তা! আমাকে দাখিল করুন সত্যরূপে এবং আমাকে বের করুন সত্যরূপে এবং  দান করুন আমাকে নিজের কাছ থেকে রাষ্ট্রীয় সাহায্য।’",
  },
  {
    id: 19,
    reference: "(সুরা মুমিনুন: ৯৪)",
    title: "মুহাম্মদ (স.)-এর দোয়া",
    arabic: "رَبِّ فَلَا تَجْعَلْنِي فِي الْقَوْمِ الظَّالِمِينَ",
    bangla: "‘রাব্বি ফালা তাজআলনী ফিল ক্বাওমাজ জোয়ালিমীন।’",
    meaning:
      "অর্থ: ‘হে আমার রব! আপনি আমাকে অবিচারকারী সম্প্রদায়ের অন্তর্ভুক্ত করবেন না।’",
  },
];
