export const  eventdualist =[
    {
        id: 1,
        title: "ঘুম থেকে উঠার পর দুআ ",
        arabic: "اَلْحَمْدُ لِلّٰهِ الَّذِیْۤ اَحْیَانَا بَعْدَ مَاۤ اَمَاتَنَا وَ اِلَیْهِ النُّشُوْرُ",
        bangla:"‘আলহামদুলিল্লা হিল্লাজি আহইয়ানা বা’দা মা আমাতানা ওয়া ইলাইহিন নুশুর’",
        meaning:"অর্থ : সমস্ত প্রশংসা আল্লাহর জন্য, যিনি আমাদের মৃত করার পর পুনরায় জীবিত করেছেন। আর তার দিকেই সবার পুনরুত্থান। ",
        reference: "(বুখারি, হাদিস : ৬৩২৪) (মুসলিম, হাদিস : ২৭১১)",
      },
        {
            id: 2,
            title: "ঘুমের আগে দুআ ",
            arabic:"اَللَّهُمَّ بِاسْمِكَ أَمُوتُ وَأَحْيَ",
            bangla:"আল্লাহুম্মা বিসমিকা আমুতু ওয়া আহইযা",
            meaning:"অর্থ : হে আল্লাহ, আপনার নামেই আমি মৃত্যুবরণ করি এবং আপনার নামেই জীবিত হই।",
            reference: "(বুখারি, হাদিস : ৬৩২৪) (মুসলিম, হাদিস : ৪৮৮৬)",
        },
        {
            id: 3, // একটি অনন্য আইডি দিন
            title: "দুই সিজদার মাঝে বৈঠকের দোয়া",
            arabic: "اَللّهُمَّ اغْفِرْلِيْ وَارْحَمْنِيْ (وَاجْبُرْنِيْ وَارْفَعْنِيْ) وَاهْدِنِيْ وَعَافِنِيْ وَارْزُقْنِيْ",
            bangla: "আল্লা-হুম্মাগফিরলী ওয়ারহামনী ওয়াজবুরনী ওয়াররফা’নী ওয়াহহ্‌দিনী ওয়া আ-ফিনী ওয়ারযুক্বনী।",
            meaning: "অর্থ- হে আল্লাহ! আমাকে ক্ষমা কর, দয়া কর, আমার প্রয়োজন মিটাও, আমাকে উঁচু কর, পথ দেখাও, নিরাপত্তা দাও এবং জীবিকা দান কর।",
            reference: "(আবূদাঊদ-৮৫০, তিরমিযী-২৮৪, ইবনে মাজাহ্‌-৮৯৮,হাকেম, মুস্তাদরাক)",
        }



]