export const ayaList = [
  {
    id: 1,
    arabic: "وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ",
    bangla: "ওয়া রাহমাতী ওয়াছি‘আত কুল্লা শাইয়িন",
    meaning: "অর্থ: আমার রহমত সব বস্তুকে আবৃত করে আছে।",
    reference: "(সূরা আরাফ, আয়াত: ১৫৬)",
  },
  {
    id: 2,
    arabic: "فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ",
    bangla: "ফাযকুরূনী আযকুরকুম ওয়াশকুরূ লী ওয়ালা তাকফুরূন",
    meaning: "অতএব তোমরা আমাকে স্মরণ কর, আমিও তোমাদের স্মরণ রাখব এবং আমার কৃতজ্ঞতা প্রকাশ কর; অকৃতজ্ঞ হয়ো না।",
    reference: "(সূরা বাকারা, আয়াত: ১৫২)",
  },
  {
    id: 3,
    arabic: "إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
    bangla: "ইন্নাল্লাহা আলা কুল্লি শাইয়িন ক্বাদীর",
    meaning: "নিশ্চয়ই আল্লাহ সব কিছুর উপর ক্ষমতাবান।",
    reference: "(সূরা বাকারা, আয়াত: ২০)",
  },
  {
    id: 4,
    arabic: "وَمَا كَانَ اللَّـهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ",
    bangla: "ওয়া মা কানাল্লাহু মুআযযিবাহুম ওয়া হুম ইয়াস্তাগফিরুন।",
    meaning: "অর্থ: এবং তারা যতক্ষণ ক্ষমা প্রার্থনা করতে থাকবে আল্লাহ কখনও তাদের উপর আযাব দেবেন না। ",
    reference: "(সূরা আল-আনফাল, আয়াত: ৩৩)",
  },
  {
    id: 5,
    arabic: "لَا يُكَلِّفُ اللَّـهُ نَفْسًا إِلَّا وُسْعَهَا",
    bangla: "লা ইউকাল্লিফুল্লাহু নফসান ইল্লা উসআহা",
    meaning: "অর্থ: আল্লাহ কাউকে তার সাধ্যাতীত কোনো কাজের ভার দেন না।",
    reference: "(সূরা বাকারা, আয়াত: ২৮৬)",
  },
  {
    id: 6,
    arabic:"إِنَّ مَعَ الْعُسْرِ يُسْرًا",
    bangla:"ইন্না মা‘আল উসরি ইউসরা",
    meaning: "অর্থ: নিশ্চয় কষ্টের সাথে স্বস্তি রয়েছে। ",
    reference: "(সূরা ইনশিরাহ, আয়াত: ৬)",
  },
  {
    id: 7,
    arabic:" فَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ ﴿﴾ وَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ",
    bangla:"ফামাইঁ ইয়া'মাল মিছক্বালা যাররাতিন খাইরাইঁ ইয়ারা'হ। ওয়া মাইঁ ইয়া'মাল মিছক্বালা যাররাতিন শাররাইঁ ইয়ারা'হ। ",
    meaning: "অর্থ: অতপর কেউ অণু পরিমাণ সৎকর্ম করলে তা দেখতে পাবে। এবং কেউ অণু পরিমাণ অসৎকর্ম করলে তাও দেখতে পাবে।  ",
    reference: "(সূরা যিলযাল, আয়াত: ৬-৭)",
  },
  {
    id: 8,
    arabic:"لَا إِكْرَاهَ فِي الدِّينِ ۖ قَد تَّبَيَّنَ الرُّشْدُ مِنَ الْغَيِّ ۚ فَمَن يَكْفُرْ بِالطَّاغُوتِ وَيُؤْمِن بِاللَّهِ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَىٰ لَا انفِصَامَ لَهَا ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ  ",
    bangla:"লা-ইকরা-হা ফিদদী-নি ক্বাত্তাবাইয়ানার রুশদু মিনালগাইয়ি ফামাইঁ ইয়াকফুর বিত্তা-গূতি ওয়া ইউ'মিম বিল্লা-হি ফাক্বাদিসতামসাকা বিল'উরওয়াতিল উছক্বা- লানফিসা-মা লাহা- ওয়াল্লা-হু সামী'উন 'আলীম।",
    meaning: "অর্থ:দ্বীনের ব্যাপারে কোনো জবরদস্তি নেই। নিঃসন্দেহে হেদায়াত গোমরাহি থেকে স্পষ্ট হয়ে গেছে। এখন যারা তাগুতকে অস্বীকার করে আল্লাহর প্রতি ঈমান আনবে, তারা এমন এক মজবুত হাতল ধরবে যা কখনো ভাঙার নয়। আর আল্লাহ সবকিছু শোনেন ও জানেন। ",
    reference: "(সুরা : বাকারা, আয়াত : ২৫৬)",
  },
  // ... অন্যান্য আয়াত যোগ করুন
  ];